Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If you are running under C<use strict> (and if you aren't, why in the world aren't you?), you'll have to add some declarations to make it happy:
es_es: Si está ejecutando bajo C<use strict> (y si no lo está haciendo, ¿por qué demonios no?), tendrá que agregar algunas declaraciones para hacerle feliz:

source: // m{} Pattern match yes*
es_es: // m{} Coincidencia sí*

source: Most C<C> source files now have comments at the top explaining their purpose, which should help anyone wishing to get an overview of the implementation.
es_es: La mayoría de los archivos de código fuente C<C> ya tienen comentarios en la parte superior explicando su propósito, que debe ayudar a cualquier persona que desee obtener una visión general de la aplicación.

source: They take only one byte per character.
es_es: Ocupan un solo byte por carácter.

source: Syscall returns whatever value returned by the system call it calls.
es_es: Syscall devuelve cualquier valor devuelto por la llamada al sistema que llama.

source: The associated handler is called with the error text and can change the error message, if it sees fit, by calling C<die> again.
es_es: El identificador de archivo asociado es llamado con el texto del error y puede cambiar el mensaje de error, si le parece, llamando de nuevo a C<die>.

source: You can preallocate space for a hash by assigning to the keys() function.
es_es: Se puede pre-reservar espacio para un hash asignando a la función keys().

source: If it returns inconsistent results (sometimes saying C<$x[1]> is less than C<$x[2]> and sometimes saying the opposite, for example) the results are not well-defined.
es_es: Si devuelve resultados inconsistentes (algunas veces diciendo que C<$x[1]> es menor que C<$x[2]> y otras veces diciendo lo opuesto, por ejemplo) los resultados no están definidos.

source: FUNCTION is a reference to, or the name of, the function whose prototype you want to retrieve.
es_es: FUNCIÓN es una referencia a, o el nombre de, la función cuyo prototipo se desea recuperar.

source: Example, assuming array lengths are passed before arrays:
es_es: Ejemplo, suponiendo que las longitudes de array se pasan antes que los propios arrays:

source: This caused the false idiom such as:
es_es: Esto permitía hacer el falso modismo:

source: See L<perlpacktut> for an introduction to this function.
es_es: Vea L<perlpacktut> para una introducción a esta función.

source: Shifting by a negative number of bits is also undefined.
es_es: Desplazando por un número negativo de bits también está indefinido.

source: tell() on pipes, fifos, and sockets usually returns -1.
es_es: tell() en tuberías, colas, y sockets, por lo general, devuelve -1.

# printf "child exited with value %d ", $?
source: printf "child exited with value %d\n", $?
es_es: printf "hijo terminó con valor %d\n", $?

source: =head1 Documentation
es_es: =head1 Documentación

source: =head1 DESCRIPTION
es_es: =head1 DESCRIPCIÓN

source: That is,
es_es: Es decir,

source: This operator is not as well defined for negative operands, but it will execute faster.
es_es: Este operador no está tan bien definido para operandos negativos, pero se ejecutará más rápido.

source: ISBN 978-0-596-00313-5 [2nd Edition August 2003]
es_es: ISBN 978-0-596-00313-5 [2ª edición - Agosto de 2003]

source: Similarly for the C<:encoding> pragma: in that case pretty much any characters can be sent.
es_es: Del mismo modo, para el pragma C<:encoding>: en este caso casi todos los caracteres se pueden enviar.

source: for (@old) {
es_es: for (@viejo) {

source: In addition to this limitation, the exponent of the binary number is also restricted when it is represented as a floating point number.
es_es: Además de esta limitación, el exponente del número binario también está restringido cuando se representa como un número de punto flotante.

source: Maybe you should, too.
es_es: Es posible que a usted también le resulte útil.

source: undef Array array contains undef grep !defined, @$b
es_es: undef Array array contiene undef grep !defined, @$b

source: Changes the working directory to EXPR, if possible.
es_es: Cambia el directorio de trabajo a EXPR, si es posible.

source: The Ram is a cookbook with hundreds of examples of using Perl to accomplish specific tasks:
es_es: El "Libro del Carnero" es un recetario que incluye cientos de ejemplos del uso de Perl para realizar tareas específicas:

source: # sort lexically
es_es: # ordenación léxica

source: Therefore perl 5.8.1 introduces a "backdoor" to restore the pre-5.8.0 (pre-5.7.3, really) signal behaviour.
es_es: Por lo tanto, perl 5.8.1 introduce una "puerta trasera" para restaurar el comportamiento pre-5.8.0 (pre-5.7.3, en realidad) de las señales.

source: These modifiers are restored at the end of the enclosing group.
es_es: Estos modificadores son reiniciados al final del grupo que lo alberga.

source: nonassoc ..
es_es: no asoc. ..

source: =head1 AUTHORS
es_es: =head1 AUTORES

source: # using a prototype allows you to use any comparison subroutine
es_es: # usando un prototipo permite usar cualquier subrutina de comparación

source: The name of the character in the 100th position (indexed by 0) in Unicode is C<LATIN CAPITAL LETTER A WITH MACRON>.
es_es: El nombre del carácter en la posición 100 (basado en 0) en Unicode es C<LATIN CAPITAL LETTER A WITH MACRON>.

source: F<xsubpp> will compile XS code into C code by embedding the constructs necessary to let C functions manipulate Perl values and creates the glue necessary to let Perl access those functions.
es_es: F<xsubpp> compila el código XS y genera código C; para ello, incrusta las construcciones necesarias para que las funciones C puedan manipular valores Perl y agregar el código necesario para que Perl pueda acceder a esas funciones.

source: =head2 Acknowledgments
es_es: =head2 Reconocimientos

source: README.beos - Perl version 5.8+ on BeOS
es_es: README.beos - Perl versión 5.8+ en BeOS

source: Its bytes represent an unsigned integer in base 128,
es_es: Sus bytes representan un entero sin signo en base 128,

source: \C Match a single C-language char (octet) even if that is part of a larger UTF-8 character.
es_es: \C Coincide con un char (octeto, en lenguaje C) incluso si es parte de un carácter UTF-8 más grande.

source: If CMD is C<IPC_STAT>, then ARG must be a variable that will hold the returned C<msqid_ds> structure.
es_es: Si CMD es C<IPC_STAT>, entonces ARG debe ser una variable que contendrá la estructura C<msqid_ds> devuelta.

source: This escape mechanism is also required for the character used as the pattern delimiter.
es_es: Este mecanismo de escape también es necesario para el carácter utilizado como delimitador de patrones.

source: A Package modified in such a way shall still be considered the Standard Version.
es_es: Un paquete modificado de esa manera todavía puede ser considerado Versión Estándar.

source: Regardless of the machine architecture on which it runs, the example above should print the following table:
es_es: Independientemente de la arquitectura de la máquina en la que se ejecuta, el ejemplo anterior debe imprimir el cuadro siguiente:

source: $cnt = $sky =~ tr/*/*/; # count the stars in $sky
es_es: $cnt = $sky =~ tr/*/*/; # cuenta los asteriscos en $sky

source: require "Foo::Bar"; # not a bareword because of the ""
es_es: require "Foo::Bar"; # no una palabra suelta por las ""

source: This will lead you to other important man pages, including how to set your C<$MANPATH>.
es_es: Esto le llevará a otras páginas de manual importantes, como la que explica cómo configurar C<$MANPATH>.

source: C<DB> upgraded to version 1.01
es_es: C<DB> actualizado a la versión 1.01

source: Note that the values are not copied, which means modifying them will modify the contents of the hash:
es_es: Tenga en cuenta que los valores no son copiados, lo que significa que modificarles modificará el contenido del hash:

source: modularity and reusability using innumerable modules
es_es: modularidad y capacidad de reutilización gracias a numerosos módulos

source: See I<What is CPAN?> in L<perlfaq2>.
es_es: Vea I<¿Qué es CPAN?> en L<perlfaq2>.

source: On POSIX systems, you can detect this condition this way:
es_es: En sistemas POSIX, puede detectar esta condición de esta manera:

# die "Can't cd to spool: $! " unless chdir '/usr/spool/news';
source: die "Can't cd to spool: $!\n" unless chdir '/usr/spool/news';
es_es: die "No puedo cd a spool: $!\n" unless chdir '/usr/spool/news';

source: =for comment Consistent formatting of this file is achieved with:
es_es: =for comment Para aplicar un formato uniforme a este archivo, use:

source: C<PerlIO> upgraded to version 1.04
es_es: C<PerlIO> actualizado a la versión 1.04

source: For floating-point conversions (C<e f g E F G>), numbers are usually assumed to be the default floating-point size on your platform (double or long double), but you can force "long double" with C<q>, C<L>, or C<ll> if your platform supports them.
es_es: Para las conversiones de punto flotante (C<e f g E F G>), se asume que los números son por lo general de punto flotante del tamaño de su plataforma (doble o doble largo), pero se puede forzar "long double" con C<q>, C<L>, o C<ll> si la plataforma es compatible con ellas.</q>

source: (The string specified with C<=~> need not be an lvalue--it may be the result of an expression evaluation, but remember the C<=~> binds rather tightly.) See also L<perlre>.
es_es: (La cadena especificada con C<=~> no tiene por qué ser un I<ivalor>; puede ser el resultado de una evaluación de una expresión, pero recuerde que C<=~> enlaza más firmemente). Vea también L<perlre>.

source: How to create a new module
es_es: Cómo crear un nuevo módulo

# local $SIG{ALRM} = sub { die "alarm " }; # NB: required
source: local $SIG{ALRM} = sub { die "alarm\n" }; # NB: \n required
es_es: local $SIG{ALRM} = sub { die "alarma\n" }; # NB: \n necesario

source: Perl 5.8 and later will emulate socketpair using IP sockets to localhost if your system implements sockets but not socketpair.
es_es: Perl 5.8 y siguientes emularán socketpair usando sockets IP a localhost si el sistema implementa sockets pero no socketpair.

source: perlamiga Perl notes for AmigaOS
es_es: perlamiga Notas para AmigaOS

source: This one is actually a change introduced in 5.10.0, but it was missed from that release's perldelta, so it is mentioned here instead.
es_es: Este es en realidad un cambio introducido en 5.10.0, pero se perdió en la publicación de perldelta, por lo que se menciona aquí y ahora.

source: That means C<< <$x> >> is always a readline() from an indirect handle, but C<< <$hash{key}> >> is always a glob().
es_es: Esto significa que C<< <$x> >> siempre es un readline() de un identificador de archivo indirecto, pero C<< <$hash{clave}> >> siempre es un glob().

source: perlhurd Perl notes for Hurd
es_es: perlhurd Notas para Hurd

source: It's documented in extravagant detail in L<perlfunc> and L<perlopentut>, but in short:
es_es: Esta función se describe de forma muy detallada en L<perlfunc> y L<perlopentut>. A continuación se muestra un resumen de cómo se usa:

source: =item sub NAME (PROTO) BLOCK
es_es: =item sub NOMBRE (PROTO) BLOQUE

source: If you get in the habit of using C<"\n"> for networking, you may be burned some day.
es_es: Si se metes en el hábito de usar C<"\n"> en la gestión de redes, es posible que un día se queme.

source: See L<perlfunc/wantarray> for how you would dynamically discern your function's calling context.
es_es: Ver L<perlfunc/wantarray> para saber cómo se averiguaría dinámicamente el contexto en el cual se llamó a una función.

source: CONTEXTS SIGILS ARRAYS HASHES
es_es: CONTEXTOS SIGILOS ARRAYS HASHES

source: Only hexadecimal digits are valid between the braces.
es_es: Solo están permitidos los dígitos hexadecimales entre las llaves.

source: The C<while> statement executes the block as long as the expression is L<true|/"Truth and Falsehood">.
es_es: La instrucción C<while> ejecuta el bloque mientras la expresión sea L<verdadera|/"Verdad y Falsedad">.

source: Typeglobs are also a way to create a local filehandle using the local() operator.
es_es: Typeglobs son también una manera de crear un identificador de archivo local usando el operador local().

source: =item (minimum) width
es_es: =item ancho (mínimo)

source: $straddr = inet_ntoa($iaddr);
es_es: $direccion = inet_ntoa($idireccion);

source: If you are using as compiler GCC-2.95.x rev(DG/UX) an easy solution for configuring perl in your DG/UX machine is to run the command:
es_es: Si está utilizando como compilador el GCC-2.95.x revisión DG/UX, una solución fácil para la configuración de perl en su máquina DG/UX es ejecutar el comando:

source: and UTF-8 (or UTF-EBCDIC in EBCDIC platforms) in byte mode.
es_es: y UTF-8 (o UTF-EBCDIC en plataformas EBCDIC) en modo byte.

source: # these examples are subject to system-specific variation
es_es: # estos ejemplos están sujetos a variaciones específicas del sistema

source: Therefore, the result of
es_es: Por lo tanto, el resultado de

source: Subscripted variables such as C<$a[3]> or C<< $href->{key}[0] >> are also interpolated, as are array and hash slices.
es_es: Variables con subrangos, como C<$a[3]> o C<< $href->{clave}[0] >> son también interpoladas, así como trozos de array y hash.

source: =item getsockopt SOCKET,LEVEL,OPTNAME X<getsockopt>
es_es: =item getsockopt SOCKET,NIVEL,OPCIÓN X<getsockopt>

source: To get started, run this command:
es_es: Para comenzar, ejecute este comando:

source: If a module or pragma only needs to be loaded conditionally, this can be done using the L<if> pragma:
es_es: Si un módulo o pragma sólo necesita ser cargado en forma condicional, esto se puede hacer uso del pragma L<if>:

source: Some of the most interesting features have shown up in the latest versions of Perl 5, and some Perl 5 modules allow you to use some Perl 6 syntax in your programs.
es_es: Algunas de las características más interesantes de Perl 6 se han incluido en las versiones más recientes de Perl 5, y algunos módulos de Perl 5 le permiten usar la sintaxis de Perl 6 en sus programas.

source: If CMD is C<IPC_STAT>, then ARG must be a variable that will hold the returned C<shmid_ds> structure.
es_es: Si CMD es C<IPC_STAT>, entonces ARG debe ser una variable que contendrá la estructura C<shmid_ds> devuelta.

source: If LENGTH is negative, leaves that many characters off the end of the string.
es_es: Si LONGITUD es negativa, deja fuera a tantos caracteres del final de la cadena.

source: Packing with a I<length-item> of C<a> or C<Z> may introduce C<"\000"> characters, which Perl does not regard as legal in numeric strings.
es_es: Empaquetando con un I<longitud-item> de C<a> o C<Z> puede introducir caracteres C<"\000">, que Perl no considerará como legal en cadenas numéricas.

source: =head2 Loop Control X<loop control> X<loop, control> X<next> X<last> X<redo> X<continue>
es_es: =head2 Control de bucles X<loop control> X<loop, control> X<next> X<last> X<redo> X<continue> X<control de bucles> X<bucle, control>

source: It's possible to substitute for a simple identifier, an expression that produces a reference to the value at runtime.
es_es: También, es posible sustituir un simple identificador por una expresión que produzca una referencia al valor en tiempo de ejecución.

source: These are usually written as "the C</x> modifier", even though the delimiter in question might not really be a slash.
es_es: Estos, se describen normalmente como "el modificador C</x>", incluso aunque el delimitador en cuestión podría no ser en realidad una barra.

source: This also means that modifying a variable twice in the same statement will lead to undefined behavior.
es_es: Esto también significa que la modificación de una variable dos veces en la misma instrucción dará lugar a un comportamiento indefinido.

source: =item exit EXPR X<exit> X<terminate> X<abort>
es_es: =item exit EXPR X<exit> X<terminate> X<abort> X<abortar> X<terminar> X<salir>

source: sys/libcall error
es_es: error de sys/libcall

source: -S File is a socket.
es_es: -S Archivo es un socket.

source: For cleaner embedding you can also force this for all APIs by defining at compile time the cpp define PERL_NO_SHORT_NAMES.
es_es: Para una incorporación más limpia también puede forzar esto para todas las API definiendo, en tiempo de compilación, el B<define> PERL_NO_SHORT_NAMES para cpp.

source: Perl operators have the following associativity and precedence, listed from highest precedence to lowest.
es_es: Los operadores Perl tienen la asociatividad y precedencia siguientes, enumerados de mayor a menor prioridad.

source: =item Functions new in perl5 X<perl5>
es_es: =item Funciones nuevas en perl5 X<perl5>

source: $HOST = $host =~ tr/a-z/A-Z/r; # same thing
es_es: $HOST = $host =~ tr/a-z/A-Z/r; # lo mismo

source: See L<perlrecharclass/POSIX Character Classes>.
es_es: Vea L<perlrecharclass/POSIX Character Classes>.

source: require 5.006_001; # ditto; preferred for backwards compatibility
es_es: require 5.006_001; # idem; preferido para mantener la compatibilidad

source: =head1 Acknowledgements
es_es: =head1 Agradecimientos

source: The core distribution can now run its regression tests in parallel on Unix-like platforms.
es_es: La distribución principal ahora puede ejecutar sus pruebas de regresión en paralelo en las plataformas de tipo Unix.

source: and for writing:
es_es: y para escritura:

source: \E end either case modification or quoted section, think vi
es_es: \E fin de modificación de tamaño de caja o sección entrecomillada, como en vi

source: Each call disables the previous timer, and an argument of C<0> may be supplied to cancel the previous timer without starting a new one.
es_es: Cada llamada desactiva el temporizador anterior, y se puede indicar un argumento C<0> para cancelar el temporizador anterior sin empezar uno nuevo.

source: The I<Perl-Zeitung> is a German-speaking magazine for Perl beginners (see http://perl-zeitung.at.tf ).
es_es: I<Perl-Zeitung> es otra revista en alemán para programadores Perl principiantes (visite http://perl-zeitung.at.tf ).

source: POSIX 1003.1 compliant library
es_es: biblioteca compatible con POSIX 1003.1

source: Note that function names are considered more readable with parentheses after their name, that is C<function()>.
es_es: Note como los nombres de función se vuelven más legibles con los paréntesis detrás de su nombre, como esta C<funcion()>.

source: C<foreach> probably won't do what you expect if VAR is a tied or other special variable.
es_es: C<foreach> probablemente no hará lo esperado si VAR está enlazada a otra variable especial.

source: This interpolation combines with the facts that the opening and closing parentheses are optional (except when necessary for precedence) and lists may end with an optional comma to mean that multiple commas within lists are legal syntax.
es_es: Esta interpolación se combina con el hecho de que la apertura y cierre de paréntesis son opcionales (excepto cuando sea necesario para la precedencia) y las listas pueden terminar con una coma opcional, significando que comas múltiples dentro de las listas es sintaxis legal.

source: Customary Generic Meaning Interpolates
es_es: Normal Genérico Significado Interpola

source: Non-bracketing delimiters use the same character fore and aft, but the four sorts of ASCII brackets (round, angle, square, curly) all nest, which means that
es_es: Delimitadores no emparejados usan el mismo carácter delante y detrás, pero los otros cuatro delimitadores (paréntesis, corchetes, ángulos y llaves) pueden ser anidados, lo que significa que

source: This may seem a bit weird, but that's okay, because it is weird.
es_es: Ésto puede parecer un poco raro, pero eso está bien, porque es raro.

source: It derives from the ubiquitous C programming language and to a lesser extent from sed, awk, the Unix shell, and at least a dozen other tools and languages.
es_es: Se deriva del extendido lenguaje de programación C y, en menor medida, de sed, awk, la shell de Unix, y al menos una docena más de lenguajes y herramientas.

source: # inspired by :1,$g/fred/s//WILMA/
es_es: # inspirado por :1,$g/fred/s//WILMA/

source: If the LABEL is omitted, the command refers to the innermost enclosing loop.
es_es: Si la ETIQUETA se omite, el comando se refiere al bucle más interior en que se encuentre.

source: Use C<XSLoader> for faster loading
es_es: Usa C<XSLoader> para acelerar la carga

source: @sauces = <<End_Lines =~ m/(\S.*\S)/g;
es_es: @salsas = <<Fin_lineas =~ m/(\S.*\S)/g;

source: However, C<print()> can also take an optional first argument specifying which filehandle to print to:
es_es: Sin embargo, C<print()> también puede consumir un primer argumento opcional que especifique el identificador de archivo en el que se debe imprimir:

source: =item C<(?<!pattern)> X<(?<!)> X<look-behind, negative> X<lookbehind, negative>
es_es: =item C<(?<!patrón)> X<(?<!)> X<antecedente, negativo> X<antecedente, negativo>

source: (But there are saner ways of accomplishing this than using C</o>.)
es_es: (Pero hay formas más sanas de lograr esto que usando C</o>.)

source: $mode = 0644; chmod $mode, "foo"; # this is best
es_es: $modo = 0644; chmod $modo, "foo"; # este es el mejor

source: If you want to know which files you could not remove, try them one at a time:
es_es: Si quiere saber qué archivos no pudo eliminar, trátelos de uno en uno:

source: one-third of the time.
es_es: un tercio de las ocasiones.

source: =item int EXPR X<int> X<integer> X<truncate> X<trunc> X<floor>
es_es: =item int EXPR X<int> X<integer> X<truncate> X<trunc> X<floor> X<truncar> X<trunca> X<entero>

source: The following example counts all the possible matching strings in a pattern (without actually matching any of them).
es_es: El siguiente ejemplo cuenta todas las posibles cadenas coincidentes con un patrón (sin que se produzca una coincidencia con ninguna de ellas, por efecto del C<(*FAIL)>).

source: The following pattern matches a function foo() which may contain balanced parentheses as the argument.
es_es: El siguiente patrón coincide con una función foo() que puede contener paréntesis balanceados como argumento.

source: # list context
es_es: # contexto lista

source: C<delete local> now allows you to locally delete a hash entry.
es_es: C<delete local> ahora le permite borrar localmente una entrada de un hash.

source: As a special case for C<split>, the empty pattern C<//> specifically matches the empty string; this is not be confused with the normal use of an empty pattern to mean the last successful match.
es_es: Como un caso especial para C<split>, el patrón vacío C<//> específicamente coincide con la cadena vacía; esto no ha de ser confundido con el uso normal de un patrón vacío que significa la última coincidencia exitosa.

source: There may be 0, 1, or several different ways that the definition might succeed against a particular string.
es_es: Puede ser 0, 1, u otras formas diferentes en que la definición podría tener éxito contra una cierta cadena de caracteres.

source: =item symlink OLDFILE,NEWFILE X<symlink> X<link> X<symbolic link> X<link, symbolic>
es_es: =item symlink VIEJO,NUEVO X<symlink> X<link> X<symbolic link> X<link, symbolic> X<enlace simbólico> X<enlace>

source: A list value may also be subscripted like a normal array.
es_es: Una lista de valores también pueden ser indexadas como un array normal.

source: introduce the perlivp utility for verifying the Perl installation (IVP = Installation Verification Procedure)
es_es: introducir la utilidad perlivp para comprobar la instalación de Perl (PIV = Procedimiento de Verificación de la instalación)
